Revit 2024 API
IExportContextBase Interface
 An interface that as common base for IModelExportContext and IExportContext2D.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public interface IExportContextBase : IExportContext
Visual Basic
Public Interface IExportContextBase _
	Inherits IExportContext
Visual C++
public interface class IExportContextBase : IExportContext
See Also
IExportContextBase Members
Autodesk.Revit.DB Namespace